import {
  reactRouterParameters,
  withRouter,
} from "storybook-addon-remix-react-router";
import { Meta, StoryObj } from "@storybook/react";
import Result from "./Result";
import { Location } from "@/lib/SearchResponse";

const meta: Meta<typeof Result> = {
  component: Result,
};

export default meta;
type Story = StoryObj<typeof Result>;

const respYendoooo = {
  request: {
    query: "食べ歩き",
    start_location: {
      latitude: 35.760197635082505,
      longitude: 139.7216436401367,
    },
    end_location: { latitude: 35.78345700892211, longitude: 139.7183820739746 },
  },
  paragraphs: [],
  routes: [
    {
      title: "街歩きを楽しみながらグルメを満喫するルート",
      description:
        "このルートでは、街歩きを楽しむだけでなく、途中にある飲食店で美味しいグルメを満喫することができます。",
      paths: [],
      path_geo_json: {
        type: "FeatureCollection",
        features: [
          {
            type: "Feature",
            properties: {},
            geometry: {
              type: "MultiLineString",
              coordinates: [
                [
                  [139.7274245, 35.7626603],
                  [139.7275959, 35.7624935],
                ],
                [
                  [139.7246943, 35.766922],
                  [139.7247687, 35.7667599],
                ],
                [
                  [139.7187389, 35.7819923],
                  [139.7186537, 35.782131],
                ],
                [
                  [139.7205368, 35.7776736],
                  [139.7202184, 35.7781403],
                ],
                [
                  [139.7197584, 35.7804012],
                  [139.7196285, 35.7803731],
                  [139.7196022, 35.7803768],
                  [139.7195827, 35.780395],
                  [139.7190441, 35.7814571],
                ],
                [
                  [139.7190441, 35.7814571],
                  [139.7187389, 35.7819923],
                ],
                [
                  [139.7186537, 35.782131],
                  [139.7184616, 35.7824581],
                  [139.7183047, 35.7827715],
                ],
                [
                  [139.7183047, 35.7827715],
                  [139.7180844, 35.783254],
                ],
                [
                  [139.7183652, 35.7837287],
                  [139.7185125, 35.7835764],
                  [139.718188, 35.7833142],
                  [139.7180844, 35.783254],
                ],
                [
                  [139.7218614, 35.7746924],
                  [139.7218294, 35.7750606],
                  [139.7217937, 35.7752513],
                  [139.721783, 35.7753006],
                ],
                [
                  [139.724433, 35.7674042],
                  [139.7246964, 35.7669518],
                  [139.7246943, 35.766922],
                ],
                [
                  [139.7237309, 35.7685621],
                  [139.7238414, 35.7684097],
                  [139.7239666, 35.7682053],
                  [139.7240616, 35.7680476],
                  [139.7242225, 35.7677743],
                  [139.7243488, 35.7675501],
                  [139.724433, 35.7674042],
                ],
                [
                  [139.7233399, 35.7691029],
                  [139.7234063, 35.7689713],
                  [139.7234683, 35.7688302],
                  [139.7234951, 35.7687427],
                  [139.7235114, 35.7686908],
                ],
                [
                  [139.7224947, 35.7706197],
                  [139.7225735, 35.770533],
                  [139.7226566, 35.7704227],
                ],
                [
                  [139.7223047, 35.7708063],
                  [139.7224947, 35.7706197],
                ],
                [
                  [139.722177, 35.770924],
                  [139.7223047, 35.7708063],
                ],
                [
                  [139.7231288, 35.7620646],
                  [139.7231421, 35.7617326],
                  [139.7231119, 35.7616862],
                  [139.7231285, 35.7615188],
                ],
                [
                  [139.7253429, 35.7618626],
                  [139.725137, 35.7618462],
                  [139.725076, 35.7618338],
                  [139.725023, 35.761811],
                ],
                [
                  [139.7249141, 35.7620609],
                  [139.7249173, 35.7620301],
                  [139.7249745, 35.7619311],
                  [139.725023, 35.761811],
                ],
                [
                  [139.7231288, 35.7620646],
                  [139.723153, 35.7620665],
                ],
                [
                  [139.723153, 35.7620665],
                  [139.7233699, 35.7620979],
                ],
                [
                  [139.7233699, 35.7620979],
                  [139.7234854, 35.7621146],
                ],
                [
                  [139.7240133, 35.7621879],
                  [139.7240024, 35.7621717],
                ],
                [
                  [139.7234854, 35.7621146],
                  [139.7237738, 35.7621559],
                  [139.7240133, 35.7621879],
                ],
                [
                  [139.7261118, 35.7620075],
                  [139.7266621, 35.7622195],
                ],
                [
                  [139.7273549, 35.762388],
                  [139.7273423, 35.7623691],
                  [139.7273343, 35.7623508],
                  [139.7273301, 35.7623359],
                  [139.7273314, 35.762311],
                  [139.7273389, 35.7622873],
                  [139.727406, 35.7621538],
                  [139.7273969, 35.7621055],
                  [139.7273562, 35.7620395],
                ],
                [
                  [139.7268745, 35.7622614],
                  [139.7269699, 35.7620513],
                  [139.7272918, 35.7621506],
                ],
                [
                  [139.7266621, 35.7622195],
                  [139.7268567, 35.7623006],
                ],
                [
                  [139.7224444, 35.7605499],
                  [139.7224475, 35.7603916],
                  [139.7224403, 35.759781],
                ],
                [
                  [139.7224382, 35.7608694],
                  [139.722436, 35.7608568],
                  [139.7224429, 35.7606295],
                  [139.7224444, 35.7605499],
                ],
                [
                  [139.7231285, 35.7615188],
                  [139.7229609, 35.7614959],
                ],
                [
                  [139.7225856, 35.7610439],
                  [139.7224429, 35.7608965],
                  [139.7224382, 35.7608694],
                ],
                [
                  [139.7225856, 35.7610439],
                  [139.7228574, 35.7609423],
                ],
                [
                  [139.7229609, 35.7614959],
                  [139.7229807, 35.761384],
                  [139.722988, 35.7612911],
                  [139.7229906, 35.7612657],
                  [139.7229528, 35.7611448],
                  [139.7228574, 35.7609423],
                ],
                [
                  [139.7254981, 35.7618814],
                  [139.7253429, 35.7618626],
                ],
                [
                  [139.7220863, 35.7604021],
                  [139.7221115, 35.7603775],
                  [139.7221114, 35.7603135],
                  [139.7221662, 35.7603027],
                  [139.7221623, 35.7599102],
                  [139.7221217, 35.7598472],
                  [139.7221267, 35.7594771],
                ],
                [
                  [139.7230066, 35.7697875],
                  [139.723164, 35.7694635],
                  [139.7232657, 35.7692553],
                ],
                [
                  [139.725982, 35.7619641],
                  [139.7258012, 35.7619229],
                  [139.725563, 35.7618877],
                  [139.7254981, 35.7618814],
                ],
                [
                  [139.726029, 35.7619749],
                  [139.7261118, 35.7620075],
                ],
                [
                  [139.7232657, 35.7692553],
                  [139.7233399, 35.7691029],
                ],
                [
                  [139.7219321, 35.7731169],
                  [139.7219385, 35.7733858],
                ],
                [
                  [139.719738, 35.7788268],
                  [139.7197145, 35.7788591],
                  [139.7204147, 35.7791942],
                ],
                [
                  [139.7219385, 35.7733858],
                  [139.7219319, 35.7734971],
                  [139.7219079, 35.7739041],
                  [139.7218881, 35.7742395],
                ],
                [
                  [139.7218881, 35.7742395],
                  [139.7218614, 35.7746924],
                ],
                [
                  [139.7219661, 35.7717049],
                  [139.7219655, 35.7718086],
                  [139.7219321, 35.7731169],
                ],
                [
                  [139.7219729, 35.7711652],
                  [139.7220093, 35.7712017],
                  [139.7219633, 35.7716608],
                  [139.7219661, 35.7717049],
                ],
                [
                  [139.7226566, 35.7704227],
                  [139.7227387, 35.7702904],
                  [139.7229708, 35.7698612],
                  [139.7230066, 35.7697875],
                ],
                [
                  [139.7275959, 35.7624935],
                  [139.7274579, 35.7624431],
                  [139.7273847, 35.7624152],
                  [139.7273675, 35.7624035],
                  [139.7273549, 35.762388],
                ],
                [
                  [139.7268567, 35.7623006],
                  [139.7268745, 35.7622614],
                ],
                [
                  [139.726029, 35.7619749],
                  [139.725982, 35.7619641],
                ],
                [
                  [139.7198592, 35.7788396],
                  [139.7197624, 35.7787933],
                  [139.719738, 35.7788268],
                ],
                [
                  [139.7224403, 35.759781],
                  [139.7224383, 35.7596111],
                  [139.7223955, 35.7595394],
                  [139.7223931, 35.7594163],
                ],
                [
                  [139.7219891, 35.7710972],
                  [139.722177, 35.770924],
                ],
                [
                  [139.7240024, 35.7621717],
                  [139.7242966, 35.7621661],
                  [139.7248989, 35.7622053],
                  [139.7249141, 35.7620609],
                ],
                [
                  [139.7201279, 35.7781669],
                  [139.7200941, 35.7782196],
                ],
                [
                  [139.7200941, 35.7782196],
                  [139.7198122, 35.7786584],
                  [139.7198122, 35.7786791],
                ],
                [
                  [139.7198122, 35.7786791],
                  [139.719926, 35.7787434],
                ],
                [
                  [139.7217051, 35.7756265],
                  [139.7217441, 35.7755009],
                  [139.721783, 35.7753006],
                ],
                [
                  [139.7216578, 35.7757801],
                  [139.7216839, 35.7757017],
                ],
                [
                  [139.7272918, 35.7621506],
                  [139.7273419, 35.762085],
                  [139.7273562, 35.7620395],
                ],
                [
                  [139.7219729, 35.7711652],
                  [139.7219891, 35.7710972],
                ],
                [
                  [139.719926, 35.7787434],
                  [139.719908, 35.7787693],
                ],
                [
                  [139.7198815, 35.7788098],
                  [139.7198592, 35.7788396],
                ],
                [
                  [139.7202184, 35.7781403],
                  [139.7201279, 35.7781669],
                ],
                [
                  [139.7213986, 35.7764033],
                  [139.7215685, 35.7760371],
                  [139.7216578, 35.7757801],
                ],
                [
                  [139.7216839, 35.7757017],
                  [139.7217051, 35.7756265],
                ],
                [
                  [139.719908, 35.7787693],
                  [139.7198815, 35.7788098],
                ],
                [
                  [139.7213986, 35.7764033],
                  [139.7210039, 35.7770147],
                  [139.7209128, 35.7771519],
                ],
                [
                  [139.7247687, 35.7667599],
                  [139.7248303, 35.7667135],
                  [139.7251142, 35.7661984],
                ],
                [
                  [139.7236797, 35.7686151],
                  [139.7237309, 35.7685621],
                ],
                [
                  [139.7222802, 35.7594337],
                  [139.7221811, 35.7594537],
                  [139.7221267, 35.7594771],
                ],
                [
                  [139.7199247, 35.7798636],
                  [139.7200038, 35.7797402],
                  [139.7204147, 35.7791942],
                ],
                [
                  [139.7269567, 35.7631773],
                  [139.7274245, 35.7626603],
                ],
                [
                  [139.7259313, 35.7647293],
                  [139.7260189, 35.76457],
                  [139.7261733, 35.7643168],
                  [139.7262726, 35.7641241],
                  [139.7264345, 35.7638481],
                  [139.7265868, 35.76363],
                  [139.7267832, 35.7633777],
                  [139.7269567, 35.7631773],
                ],
                [
                  [139.7256303, 35.7652611],
                  [139.7258494, 35.7648809],
                ],
                [
                  [139.7251142, 35.7661984],
                  [139.7252621, 35.7659339],
                  [139.7253873, 35.7657096],
                  [139.7254802, 35.7655423],
                  [139.7256303, 35.7652611],
                ],
                [
                  [139.7258639, 35.7648539],
                  [139.7259163, 35.7647566],
                  [139.7259313, 35.7647293],
                ],
                [
                  [139.7235114, 35.7686908],
                  [139.7236118, 35.7686591],
                  [139.7236486, 35.7686404],
                  [139.7236797, 35.7686151],
                ],
                [
                  [139.7223321, 35.759425],
                  [139.7222802, 35.7594337],
                ],
                [
                  [139.7223931, 35.7594163],
                  [139.7223321, 35.759425],
                ],
                [
                  [139.7258494, 35.7648809],
                  [139.7258639, 35.7648539],
                ],
                [
                  [139.7205368, 35.7776736],
                  [139.7205599, 35.7776827],
                ],
                [
                  [139.7209128, 35.7771519],
                  [139.7205599, 35.7776827],
                ],
                [
                  [139.7197584, 35.7804012],
                  [139.7197795, 35.7803332],
                  [139.7199247, 35.7798636],
                ],
                [
                  [139.7220863, 35.7604021],
                  [139.7220659, 35.7603607],
                ],
              ],
            },
          },
        ],
      },
      places: [],
      distance_in_meter: 3702.702938045183,
      walking_duration_in_minutes: 44,
    },
  ],
};

function getLocationFromGeoJson(lineIndex: number, pointIndex: number): Location {
  const line = respYendoooo.routes[0].path_geo_json.features[0];
  const point = line.geometry.coordinates[lineIndex][pointIndex];
  return { latitude: point[1], longitude: point[0] };
}

export const Default: Story = {
  args: {},
  decorators: [withRouter()],
  parameters: {
    reactRouter: reactRouterParameters({
      location: {
        state: {
          request: {
            query: "this is a query",
            start_location: {
              latitude: 35.671236,
              longitude: 139.757125,
            },
            end_location: {
              latitude: 35.691236,
              longitude: 139.777125,
            },
          },
          paragraphs: ["This is a paragraph."],
          routes: [
            {
              title: "Route to the nearest park, with much greenery",
              description:
                "This route will take you to the nearest park, with much greenery.",
              paths: [],
              path_geo_json: {
                type: "Feature",
                crs: {
                  type: "name",
                  properties: {
                    name: "urn:ogc:def:crs:OGC:1.3:CRS84",
                  },
                },
                properties: {},
                geometry: {
                  type: "LineString",
                  coordinates: [
                    [139.757125, 35.671236],
                    [139.767125, 35.681236],
                    [139.777125, 35.691236],
                  ],
                },
              },
              places: [
                {
                  name: "Starting point",
                  description: "The starting point of the route.",
                  location: {
                    latitude: 35.671236,
                    longitude: 139.757125,
                  },
                },
                {
                  name: "Scenic spot",
                  description: "A scenic spot along the route.",
                  location: {
                    latitude: 35.681236,
                    longitude: 139.767125,
                  },
                },
                {
                  name: "Ending point",
                  description: "The ending point of the route.",
                  location: {
                    latitude: 35.691236,
                    longitude: 139.777125,
                  },
                },
              ],
              distance_in_meter: 1200,
              walking_duration_in_minutes: 15,
            },
          ],
        },
      },
    }),
  },
};

export const YendooooSimple: Story = {
  args: {},
  decorators: [withRouter()],
  parameters: {
    reactRouter: reactRouterParameters({
      location: {
        state: respYendoooo,
      },
    }),
  },
};

export const YendooooWithManyPlaces: Story = {
  args: {},
  decorators: [withRouter()],
  parameters: {
    reactRouter: reactRouterParameters({
      location: {
        state: {
          ...respYendoooo,
          routes: [
            {
              ...respYendoooo.routes[0],
              places: [
                // List of places with Japanese names and long descriptions, with coordinates
                {
                  name: "スタート地点",
                  description: "スタート地点です",
                  location: getLocationFromGeoJson(0, 0),
                },
                {
                  name: "中間地点1",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(2, 0),
                },
                {
                  name: "中間地点2",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(4, 0),
                },
                {
                  name: "中間地点3",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(6, 0),
                },
                {
                  name: "中間地点4",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(8, 0),
                },
                {
                  name: "中間地点5",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(10, 0),
                },
                {
                  name: "中間地点6",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(12, 0),
                },
                {
                  name: "中間地点7",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(14, 0),
                },
                {
                  name: "中間地点8",
                  description:
                    "日本を代表する駅の一つ、東京駅。赤レンガの美しい丸の内駅舎が象徴的です。数多くの路線が乗り入れ、国内外から多くの人が行き交う一大交通拠点となっています。歴史的建造物としての価値も高く、国の重要文化財に指定されています。商業施設も充実しており、観光客にも人気のスポットです。",
                  location: getLocationFromGeoJson(16, 0),
                },
                // End point
                {
                  name: "エンド地点",
                  description: "エンド地点です",
                  location: getLocationFromGeoJson(18, 0),
                },
              ],
            },
          ],
        },
      },
    }),
  },
};
